# YOLOv8 Extended Model for BDD100K
# Parameters
nc: 10  # number of classes (BDD100K has 10 classes)
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# Anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv8 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C2f, [128, True]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C2f, [256, True]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 6, C2f, [512, True]],
   [-1, 1, Conv, [768, 3, 2]],  # 7-P5/32
   [-1, 3, C2f, [768, True]],
   [-1, 1, Conv, [1024, 3, 2]],  # 9-P6/64 (additional layer)
   [-1, 3, C2f, [1024, True]],  # 10 (additional C2f block)
   [-1, 1, SPPF, [1024, 5]],  # 11 (improved SPP layer)
  ]

# YOLOv8 head with extended feature pyramid
head:
  [[-1, 1, Conv, [768, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P5
   [-1, 3, C2f, [768, False]],  # 15
   
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C2f, [512, False]],  # 19
   
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C2f, [256, False]],  # 23
   
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 19], 1, Concat, [1]],  # cat P4
   [-1, 3, C2f, [512, False]],  # 26
   
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat P5
   [-1, 3, C2f, [768, False]],  # 29
   
   [-1, 1, Conv, [768, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat P6 (additional path)
   [-1, 3, C2f, [1024, False]],  # 32 (additional C2f block)
   
   [[23, 26, 29, 32], 1, Detect, [nc]],  # Detect(P3, P4, P5, P6) - adding P6 detection
  ]